app/Controllers/Sms.php

    public function sendSMS($message)
    {
        $contacts = $this->newslettermodel
            ->select('contact')
            ->findAll();
---
SELECT `contact`
FROM `newsletter`