app/Models/FishingSessionModel.php

SELECT `fs`.*, `u`.`name` as `username`, `fse`.`file`, `fse`.`file_name`
FROM `fishing_session` `fs`
JOIN `users` `u` ON `u`.`id` = `fs`.`user`
JOIN `files_session` `fse` ON `fs`.`id` = `fse`.`fishing_session`
WHERE `fs`.`deleted_at` IS NULL
AND `fse`.`deleted_at` IS NULL
---
    public function getSession()
    {
        $this->builder = $this->db->table('fishing_session fs');
        $this->builder->select('fs.*, u.name as username, fse.file, fse.file_name');
        $this->builder->join('users u', 'u.id = fs.user');
        $this->builder->join('files_session fse', 'fs.id = fse.fishing_session');
        $this->builder->where('fs.deleted_at', null);
        $this->builder->where('fse.deleted_at', null);

        // $this->builder->groupby('');
        return $this->builder->get()->getResultObject();