app/Models/MessageModel.php

SELECT `m`.*, `u`.`name` as `username`
FROM `messages` `m`
JOIN `users` `u` ON `u`.`id` = `m`.`user`
WHERE `m`.`deleted_at` IS NULL
---
    public function getMessages()
    {
        $this->builder = $this->db->table('messages m');
        $this->builder->select('m.*, u.name as username');
        $this->builder->join('users u', 'u.id = m.user');
        $this->builder->where('m.deleted_at', null);
        return $this->builder->get()->getResultObject();