app/Models/NoticeModel.php

SELECT `n`.*, `u`.`name` as `username`
FROM `notices` `n`
JOIN `users` `u` ON `u`.`id` = `n`.`user`
WHERE `n`.`deleted_at` IS NULL
---
    public function getNotices()
    {
        $this->builder = $this->db->table('notices n');
        $this->builder->select('n.*, u.name as username');
        $this->builder->join('users u', 'u.id = n.user');
        $this->builder->where('n.deleted_at', null);
        return $this->builder->get()->getResultObject();